Tag Tool [1.0.6043.10715]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...23286 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 3:40 PM.
Reading stringIDs...39505 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> 1580 
Unrecognized command: 1580
Use "help" to list available commands.

tags.dat> 1580 
Unrecognized command: 1580
Use "help" to list available commands.

tags.dat> 0FF3 
Unrecognized command: 0FF3
Use "help" to list available commands.

tags.dat> 0FF3 
Unrecognized command: 0FF3
Use "help" to list available commands.

tags.dat> 1E25 
Unrecognized command: 1E25
Use "help" to list available commands.

tags.dat> 1E25 
Unrecognized command: 1E25
Use "help" to list available commands.

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AF5
Unrecognized command: 5AF5
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AF6
Unrecognized command: 5AF6
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AF7
Unrecognized command: 5AF7
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AF8
Unrecognized command: 5AF8
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AF9
Unrecognized command: 5AF9
Use "help" to list available commands.

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> 1017
Unrecognized command: 1017
Use "help" to list available commands.

tags.dat> 1017
Unrecognized command: 1017
Use "help" to list available commands.

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AFA
Unrecognized command: 5AFA
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AFB
Unrecognized command: 5AFB
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AFC
Unrecognized command: 5AFC
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AFD
Unrecognized command: 5AFD
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AFE
Unrecognized command: 5AFE
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5AFF
Unrecognized command: 5AFF
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B00
Unrecognized command: 5B00
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B01
Unrecognized command: 5B01
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 5B02
Unrecognized command: 5B02
Use "help" to list available commands.

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo 

tags.dat> echo 

tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> echo Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands.
Reach DMR visual mod for Halo Online Eldewrito (any version) ms23. Made by Bungie, ported by dany5639 with Shockfire's tools and Camden's commands. 
tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> SetLocale US

tags.dat> 

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF6 [Offset = 0x62885F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF7 [Offset = 0x6288670, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF8 [Offset = 0x62886F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AF9 [Offset = 0x6288770, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFA [Offset = 0x62887F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFB [Offset = 0x6288870, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFC [Offset = 0x62888F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFD [Offset = 0x6288970, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFE [Offset = 0x62889F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005AFF [Offset = 0x6288A70, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B00 [Offset = 0x6288AF0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B01 [Offset = 0x6288B70, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B02 [Offset = 0x6288BF0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B03 [Offset = 0x6288C70, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B04 [Offset = 0x6288CF0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B05 [Offset = 0x6288D70, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B06 [Offset = 0x6288DF0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B07 [Offset = 0x6288E70, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B08 [Offset = 0x6288EF0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B09 [Offset = 0x6288F70, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B0A [Offset = 0x6288FF0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B0B [Offset = 0x6289070, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B0C [Offset = 0x62890F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B0D [Offset = 0x6289170, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B0E [Offset = 0x62891F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B0F [Offset = 0x6289270, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B10 [Offset = 0x62892F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B11 [Offset = 0x6289370, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B12 [Offset = 0x62893F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B13 [Offset = 0x6289470, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B14 [Offset = 0x62894F0, Size = 0x80]

tags.dat> duplicate 0
Tag duplicated successfully!
New tag: cfgt 00005B15 [Offset = 0x6289570, Size = 0x80]

tags.dat> 

tags.dat> import 0FF3  tags/modeReachDMRfp
Imported 0xC10 bytes.

tags.dat> importresource resources.dat 0FF3  tags/reachDMRfp.raw
0x00000FF3: Imported 0x360495.

tags.dat> 

tags.dat> echo fix mode
fix mode 
tags.dat> edit 0FF3 
Tag 0x00000FF3.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0FF3.render_model> SetField Nodes[0].Name gun
Name: StringID = gun

tags.dat\0x0FF3.render_model> SetField Nodes[1].Name magazine
Name: StringID = magazine

tags.dat\0x0FF3.render_model> SetField Nodes[2].Name safety
Name: StringID = safety

tags.dat\0x0FF3.render_model> SetField Nodes[3].Name ophandle
Name: StringID = ophandle

tags.dat\0x0FF3.render_model> SetField Nodes[3].DefaultTranslation 0.0035 0.003885493 0.05554584
DefaultTranslation: Vector3 = { X: 0.0035, Y: 0.003885493, Z: 0.05554584 }

tags.dat\0x0FF3.render_model> SetField markergroups[1].markers[0].Translation 0.1009767 -0.003126469 0.02598142
Translation: Vector3 = { X: 0.1009767, Y: -0.003126469, Z: 0.02598142 }

tags.dat\0x0FF3.render_model> SetField markergroups[1].markers[0].Rotation -0.6101443 0.1782749 -0.4519773 0.6258264
Rotation: Vector4 = -0.6101443, 0.1782749, -0.4519773, 0.6258264

tags.dat\0x0FF3.render_model> SetField Geometry.Compression[0].TextureMinV 0.0003441572
TextureMinV: Single = 0.0003441572

tags.dat\0x0FF3.render_model> SetField Geometry.Compression[0].TextureMaxV -1.006082
TextureMaxV: Single = -1.006082

tags.dat\0x0FF3.render_model> savechanges
Done!

tags.dat\0x0FF3.render_model> exit

tags.dat> 

tags.dat> extract 0FF3  tempTag
Wrote 0xC10 bytes to tempTag.
The tag's main struct will be at offset 0xA40.

tags.dat> 

tags.dat> echo IMPORT TEXTURES
IMPORT TEXTURES 
tags.dat> importbitmap 5AF5 DDS/dmr_diffuse_default.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005AF5 [Offset = 0x6288360, Size = 0x260]

tags.dat> importbitmap 5AF7 DDS/dmr_normal.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005AF7 [Offset = 0x6288640, Size = 0x260]

tags.dat> importbitmap 5AF6 DDS/dmr_illu.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005AF6 [Offset = 0x62885C0, Size = 0x260]

tags.dat> importbitmap 5AF8 DDS/unsc_decals_diffuse.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 00005AF8 [Offset = 0x6288A80, Size = 0x260]

tags.dat> 

tags.dat> echo import shader templates
import shader templates 
tags.dat> import 5AFD tagTemplates/1CA4_rmshTemplate
Imported 0x1D0 bytes.

tags.dat> import 5AFF tagTemplates/105F_rmshTemplate
Imported 0x4E0 bytes.

tags.dat> import 5B00 tagTemplates/105D_rmshTemplate
Imported 0x4E0 bytes.

tags.dat> import 5AFB tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5AFC tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> import 5AFA tagTemplates/0FD8_rmshTemplate
Imported 0x9B0 bytes.

tags.dat> import 5AFE tagTemplates/321E_rmshTemplate
Imported 0x1C0 bytes.

tags.dat> import 5B01 tagTemplates/205B_rmshTemplate
Imported 0xAF0 bytes.

tags.dat> 

tags.dat> edit 5B01
Tag 0x00005B01.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B01.shader> edit ShaderProperties[0]

tags.dat\0x5B01.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x5B01.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x5B01.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x5B01.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x5B01.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x5B01.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x5B01.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x5B01.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x5B01.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x5B01.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5B01.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5B01.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5B01.shader\ShaderProperties[0]> exit

tags.dat\0x5B01.shader> exit

tags.dat> 

tags.dat> extract 5B01 tempTag
Wrote 0xAE0 bytes to tempTag.
The tag's main struct will be at offset 0xA90.

tags.dat> import 5B01 tempTag
Imported 0xAE0 bytes.

tags.dat> import 5B02 tempTag
Imported 0xAE0 bytes.

tags.dat> 

tags.dat> edit 5B01
Tag 0x00005B01.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B01.shader> SpecifyBitmaps
Please enter the base_map index: 5AF5
Please enter the detail_map index: 0343
Please enter the bump_map index: 5AF7
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5AF6
Done!

tags.dat\0x5B01.shader> exit

tags.dat> 

tags.dat> edit 5B02
Tag 0x00005B02.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B02.shader> SpecifyBitmaps
Please enter the base_map index: 5AF5
Please enter the detail_map index: 0343
Please enter the bump_map index: 5AF7
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5AF6
Done!

tags.dat\0x5B02.shader> exit

tags.dat> 

tags.dat> edit 5AFC
Tag 0x00005AFC.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AFC.shader> SpecifyBitmaps
Please enter the base_map index: 5AF5
Please enter the detail_map index: 0343
Please enter the bump_map index: 5AF7
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5AF6
Done!

tags.dat\0x5AFC.shader> exit

tags.dat> edit 5AFB
Tag 0x00005AFB.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AFB.shader> SpecifyBitmaps
Please enter the base_map index: 5AF5
Please enter the detail_map index: 0343
Please enter the bump_map index: 5AF7
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 5AF6
Done!

tags.dat\0x5AFB.shader> exit

tags.dat> edit 5AFF
Tag 0x00005AFF.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AFF.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5AF9
Done!

tags.dat\0x5AFF.shader> exit

tags.dat> edit 5B00
Tag 0x00005B00.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5B00.shader> SpecifyBitmaps
Please enter the self_illum_map index: 5AF9
Done!

tags.dat\0x5B00.shader> exit

tags.dat> edit 5AFD
Tag 0x00005AFD.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AFD.shader> SpecifyBitmaps
Please enter the base_map index: 5AF8
Please enter the detail_map index: 0343
Done!

tags.dat\0x5AFD.shader> exit

tags.dat> edit 5AFA
Tag 0x00005AFA.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AFA.shader> SpecifyBitmaps
Please enter the base_map index: 0343
Please enter the detail_map index: 0343
Please enter the specular_mask_texture index: 5AF5
Please enter the self_illum_map index: 0343
Done!

tags.dat\0x5AFA.shader> exit

tags.dat> 

tags.dat> edit 5AFC
Tag 0x00005AFC.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AFC.shader> edit ShaderProperties[0]

tags.dat\0x5AFC.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x5AFC.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x5AFC.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x5AFC.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x5AFC.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x5AFC.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x5AFC.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x5AFC.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x5AFC.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x5AFC.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5AFC.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5AFC.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5AFC.shader\ShaderProperties[0]> exit

tags.dat\0x5AFC.shader> exit

tags.dat> echo gold
gold 
tags.dat> edit 5AFB
Tag 0x00005AFB.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AFB.shader> edit ShaderProperties[0]

tags.dat\0x5AFB.shader\ShaderProperties[0]> SetField Arguments[06].arg1 1
Arg1: Single = 1

tags.dat\0x5AFB.shader\ShaderProperties[0]> SetField Arguments[07].arg1 0.2
Arg1: Single = 0.2

tags.dat\0x5AFB.shader\ShaderProperties[0]> SetField Arguments[16].arg1 0.5
Arg1: Single = 0.5

tags.dat\0x5AFB.shader\ShaderProperties[0]> Setfield Arguments[19].arg1 0
Arg1: Single = 0

tags.dat\0x5AFB.shader\ShaderProperties[0]> SetField Arguments[25].arg1 0
Arg1: Single = 0

tags.dat\0x5AFB.shader\ShaderProperties[0]> SetField Arguments[25].arg2 0
Arg2: Single = 0

tags.dat\0x5AFB.shader\ShaderProperties[0]> SetField Arguments[25].arg3 0
Arg3: Single = 0

tags.dat\0x5AFB.shader\ShaderProperties[0]> SetField Arguments[28].arg1 0
Arg1: Single = 0

tags.dat\0x5AFB.shader\ShaderProperties[0]> SetField Arguments[28].arg2 1
Arg2: Single = 1

tags.dat\0x5AFB.shader\ShaderProperties[0]> SetField Arguments[28].arg3 0
Arg3: Single = 0

tags.dat\0x5AFB.shader\ShaderProperties[0]> SetField Arguments[29].arg1 0
Arg1: Single = 0

tags.dat\0x5AFB.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5AFB.shader\ShaderProperties[0]> exit

tags.dat\0x5AFB.shader> exit

tags.dat> echo gold
gold 
tags.dat> edit 5AFA
Tag 0x00005AFA.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x5AFA.shader> edit ShaderProperties[0]

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[05].Arg1 1
Arg1: Single = 1

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[02].Arg1 0.2
Arg1: Single = 0.2

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[02].Arg1 1.0
Arg1: Single = 1

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[02].Arg1 0.2
Arg1: Single = 0.2

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[02].Arg1 0
Arg1: Single = 0

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[02].Arg2 0
Arg2: Single = 0

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[02].Arg3 0
Arg3: Single = 0

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[05].Arg1 0.3
Arg1: Single = 0.3

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[09].Arg1 1
Arg1: Single = 1

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[10].Arg1 1
Arg1: Single = 1

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[12].Arg1 1
Arg1: Single = 1

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[12].Arg2 2
Arg2: Single = 2

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[12].Arg3 0
Arg3: Single = 0

tags.dat\0x5AFA.shader\ShaderProperties[0]> SetField Arguments[16].Arg1 0
Arg1: Single = 0

tags.dat\0x5AFA.shader\ShaderProperties[0]> savechanges
Done!

tags.dat\0x5AFA.shader\ShaderProperties[0]> exit

tags.dat\0x5AFA.shader> exit

tags.dat> 

tags.dat> edit 0FF3 
Tag 0x00000FF3.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x0FF3.render_model> SpecifyShaders
Please enter the replacement 0000101F index: 5B01
Please enter the replacement 0000101F index: 5AFE
Please enter the replacement 0000101F index: 5B02
Please enter the replacement 0000101F index: 5AFB
Please enter the replacement 0000101F index: 5AFC
Please enter the replacement 0000101F index: 5AFD
Please enter the replacement 0000101F index: 5AFA
Please enter the replacement 0000101F index: 5AFF
Please enter the replacement 0000101F index: 5B00
Done!

tags.dat\0x0FF3.render_model> exit

tags.dat> 

tags.dat> extract 0FF3  tempTag
Wrote 0xC30 bytes to tempTag.
The tag's main struct will be at offset 0xA60.

tags.dat> import 1E25  tempTag
Imported 0xC30 bytes.

tags.dat> 

tags.dat> echo fix reloading animation
fix reloading animation 
tags.dat> edit 1E0F
Tag 0x00001E0F.model_animation_graph has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1E0F.model_animation_graph> SetField modes[0].weaponclass[0].weapontype[0].actions[8].animation 17
Animation: Int16 = 17

tags.dat\0x1E0F.model_animation_graph> savechanges
Done!

tags.dat\0x1E0F.model_animation_graph> exit

tags.dat> 

tags.dat> echo fix: crouch melee, crouch reloading; only works if host has it;
fix: crouch melee, crouch reloading; only works if host has it; 
tags.dat> echo disabled in case hosts with it cause the game to crash for those who don't have it; untested.
disabled in case hosts with it cause the game to crash for those who don't have it; untested. 
tags.dat> echo edit 1580  YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit 1580 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR1 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR1 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR2 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR2 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR3 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR3 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR4 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR4 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR5 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR5 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> echo edit weapRDMR6 YYYY SetField WeaponName br YYYY savechanges YYYY exit
edit weapRDMR6 YYYY SetField WeaponName br YYYY savechanges YYYY exit 
tags.dat> 

tags.dat> echo edit 1017
edit 1017 
tags.dat> echo import 0 DDS/ones/numbers_plate_0.dds
import 0 DDS/ones/numbers_plate_0.dds 
tags.dat> echo import 1 DDS/ones/numbers_plate_1.dds
import 1 DDS/ones/numbers_plate_1.dds 
tags.dat> echo import 2 DDS/ones/numbers_plate_2.dds
import 2 DDS/ones/numbers_plate_2.dds 
tags.dat> echo import 3 DDS/ones/numbers_plate_3.dds
import 3 DDS/ones/numbers_plate_3.dds 
tags.dat> echo import 4 DDS/ones/numbers_plate_4.dds
import 4 DDS/ones/numbers_plate_4.dds 
tags.dat> echo import 5 DDS/ones/numbers_plate_5.dds
import 5 DDS/ones/numbers_plate_5.dds 
tags.dat> echo import 6 DDS/ones/numbers_plate_6.dds
import 6 DDS/ones/numbers_plate_6.dds 
tags.dat> echo import 7 DDS/ones/numbers_plate_7.dds
import 7 DDS/ones/numbers_plate_7.dds 
tags.dat> echo import 8 DDS/ones/numbers_plate_8.dds
import 8 DDS/ones/numbers_plate_8.dds 
tags.dat> echo import 9 DDS/ones/numbers_plate_9.dds
import 9 DDS/ones/numbers_plate_9.dds 
tags.dat> echo exit
exit 
tags.dat> echo extract 1017 tags\bitm_HRDMROnes.tag
extract 1017 tags\bitm_HRDMROnes.tag 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_0.bitm 0
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_0.bitm 0 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_1.bitm 1
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_1.bitm 1 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_2.bitm 2
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_2.bitm 2 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_3.bitm 3
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_3.bitm 3 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_4.bitm 4
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_4.bitm 4 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_5.bitm 5
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_5.bitm 5 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_6.bitm 6
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_6.bitm 6 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_7.bitm 7
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_7.bitm 7 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_8.bitm 8
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_8.bitm 8 
tags.dat> echo extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_9.bitm 9
extractresource textures.dat 1017 tags\ones\bitm_HRDMRones_9.bitm 9 
tags.dat> 

tags.dat> import 5AF9 tags/bitm_HRDMROnes.tag
Imported 0xC50 bytes.

tags.dat> 

tags.dat> importresource textures.dat 5AF9 tags/ones
0x00005AF9: Imported 0x531.

tags.dat> 

tags.dat> dumplog reachDMR.log
